# Title - VISUALIZING THE AIRBNB EXPERIENCE: INSIGHTS FROM DATA ANALYSIS

# DATA - 230 DATA VISUALIZATION FINAL PROJECT

# Group-5 
# NIVEGNA LAGADAPATI 
# PRAYAG NIKUL PURANI 
# SOUJANYA SANKATHALA 
# LEELA SAI RAHUL SURYADEVARA 
# VENKATA SAI KRISHNA VELAMALA

In [2]:
import pandas as pd
import numpy as np

# Listings.CSV

In [66]:
listing  = pd.read_csv('listings.csv')

In [67]:
listing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6854 entries, 0 to 6853
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              6854 non-null   int64
 1   name                            6854 non-null   object
 2   host_id                         6854 non-null   int64
 3   host_name                       6854 non-null   object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   6854 non-null   object
 6   latitude                        6854 non-null   float64
 7   longitude                       6854 non-null   float64
 8   room_type                       6854 non-null   object
 9   price                           6854 non-null   int64
 10  minimum_nights                  6854 non-null   int64
 11  number_of_reviews               6854 non-null   int64
 12  last_review                     5324 non-null   object
 13  reviews_per_month               5324 non-null   float64
 14  calculated_host_listings_count  6854 non-null   int64
 15  availability_365                6854 non-null   int64
 16  number_of_reviews_ltm           6854 non-null   int64
 17  license                         363 non-null    object
dtypes: float64(4), int64(8), object(6)
memory usage: 964.0+ KB

In [68]:
listing.describe()

,id,host_id,neighbourhood_group,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm
count,6.854000e+03,6.854000e+03,0.0,6854.000000,6854.000000,6854.000000,6854.000000,6854.000000,5324.000000,6854.000000,6854.000000,6854.000000
mean,3.590747e+17,1.789552e+08,NaN,37.348771,-121.964231,204.190692,11.860811,31.962066,1.207517,45.068281,196.488620,7.547563
std,4.044221e+17,1.706855e+08,NaN,0.065823,0.111290,952.410726,18.034741,64.479809,1.436986,113.234846,133.122938,13.774179
min,4.952000e+03,7.054000e+03,NaN,36.980150,-122.196520,10.000000,1.000000,0.000000,0.010000,1.000000,0.000000,0.000000
25%,3.181128e+07,3.240133e+07,NaN,37.318345,-122.045537,75.000000,1.000000,1.000000,0.260000,1.000000,76.250000,0.000000
50%,5.239634e+07,1.074344e+08,NaN,37.352180,-121.955680,128.000000,3.000000,7.000000,0.710000,3.000000,190.000000,2.000000
75%,7.951526e+17,3.058140e+08,NaN,37.396380,-121.885905,200.000000,30.000000,33.000000,1.642500,15.000000,336.000000,9.000000
max,9.830068e+17,5.372610e+08,NaN,37.459050,-121.509220,70794.000000,300.000000,828.000000,14.360000,451.000000,365.000000,157.000000

# Reviews.csv

In [3]:
review = pd.read_csv('reviews.csv')

In [4]:
review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219068 entries, 0 to 219067
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   listing_id     219068 non-null  int64
 1   id             219068 non-null  int64
 2   date           219068 non-null  object
 3   reviewer_id    219068 non-null  int64
 4   reviewer_name  219067 non-null  object
 5   comments       219014 non-null  object
dtypes: int64(3), object(3)
memory usage: 10.0+ MB

In [5]:
review.head()

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,4952,6560,2009-08-02,25672,Diane,Staying with Mei Lin and Ross at the Butterfly...
1,4952,8953,2009-09-04,27901,Michaela,I stayed with Mei Lin and Ross during a confer...
2,4952,13779,2009-10-16,33939,Mark,What a wonderful place to stay. Wonderful peop...
3,4952,19790,2009-12-10,55537,David,"Convenient & easy-going, which is what I needed."
4,4952,51096,2010-06-08,131240,SiNae,"Warm and friendly folks, very helpful! Very co..."

# Neighbourhood.csv

In [72]:
neigh = pd.read_csv('neighbourhoods.csv')

In [73]:
neigh.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   neighbourhood_group  0 non-null      float64
 1   neighbourhood        16 non-null     object
dtypes: float64(1), object(1)
memory usage: 384.0+ bytes

In [74]:
neigh.head()

   neighbourhood_group    neighbourhood
0                  NaN         Campbell
1                  NaN        Cupertino
2                  NaN           Gilroy
3                  NaN        Los Altos
4                  NaN  Los Altos Hills

# Cleaning for listing dataset

In [75]:
# we will be removing the column named neighbourhood_group and license as this column too many missing
columns_to_drop = ['neighbourhood_group', 'license']
listing = listing.drop(columns=columns_to_drop)

In [76]:
#Check for missing values
missing_values = listing.isnull().sum()
missing_values

id                                   0
name                                 0
host_id                              0
host_name                            0
neighbourhood                        0
latitude                             0
longitude                            0
room_type                            0
price                                0
minimum_nights                       0
number_of_reviews                    0
last_review                       1530
reviews_per_month                 1530
calculated_host_listings_count       0
availability_365                     0
number_of_reviews_ltm                0
dtype: int64

In [77]:
# Droping duplicates if any
listing = listing.drop_duplicates()

In [78]:
# Convert data types if needed (e.g., convert 'last_review' to datetime)
listing['last_review'] = pd.to_datetime(listing['last_review'])

In [79]:
listing.head()

,id,name,host_id,host_name,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm
0,4952,Place to stay in Palo Alto · ★4.81 · 1 bedroom...,7054,Mei Lin,Palo Alto,37.43932,-122.15741,Private room,77,14,82,2023-08-26,0.48,5,318,6
1,11464,Rental unit in Santa Clara · ★4.50 · Studio · ...,42458,Emey,Santa Clara,37.34415,-121.98701,Entire home/apt,89,3,20,2023-08-05,0.18,13,56,4
2,21373,Place to stay in Palo Alto · ★4.87 · 1 bedroom...,7054,Mei Lin,Palo Alto,37.43972,-122.15532,Private room,77,4,268,2023-06-10,1.65,5,259,4
3,62799,Place to stay in Palo Alto · ★4.89 · 1 bedroom...,7054,Mei Lin,Palo Alto,37.43934,-122.15723,Private room,85,5,154,2023-06-24,1.36,5,268,5
4,75284,Place to stay in Palo Alto · ★4.86 · 1 bedroom...,7054,Mei Lin,Palo Alto,37.43923,-122.15745,Private room,75,14,211,2023-07-23,1.40,5,226,3

In [80]:
listing = listing.fillna(9999-99-99)

In [81]:
listing.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6854 entries, 0 to 6853
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              6854 non-null   int64
 1   name                            6854 non-null   object
 2   host_id                         6854 non-null   int64
 3   host_name                       6854 non-null   object
 4   neighbourhood                   6854 non-null   object
 5   latitude                        6854 non-null   float64
 6   longitude                       6854 non-null   float64
 7   room_type                       6854 non-null   object
 8   price                           6854 non-null   int64
 9   minimum_nights                  6854 non-null   int64
 10  number_of_reviews               6854 non-null   int64
 11  last_review                     6854 non-null   object
 12  reviews_per_month               6854 non-null   float64
 13  calculated_host_listings_count  6854 non-null   int64
 14  availability_365                6854 non-null   int64
 15  number_of_reviews_ltm           6854 non-null   int64
dtypes: float64(3), int64(8), object(5)
memory usage: 910.3+ KB

In [82]:
# Save the cleaned data to a new CSV file
listing.to_csv('cleaned_listing.csv', index=False)

# Cleaning for review dataset

In [83]:
# Check for missing values
missing_values = review.isnull().sum()
missing_values

listing_id    0
date          0
dtype: int64

In [84]:
# Convert the 'date' column to a datetime format
review['date'] = pd.to_datetime(review['date'])
# Check for duplicates and remove them
review = review.drop_duplicates()

In [85]:
# Save the cleaned data to a new CSV file
#review.to_csv('cleaned_review.csv', index=False)